In [64]:
import pandas as pd

clients = {
    'code': ['C11', 'C22', 'C33', 'C44'],
    'nom': ['Martin', 'Durand', 'Leboeuf', 'Carolin'],
    'age': [50, 40, 20, 35],
    'ville': ['Bordeaux', 'Pessac', 'Bordeaux', 'La Rochelle'],
    'cuisine_a_theme': ['y', 'n', 'n', 'y'],
    'livraison': ['y', 'y', 'n', 'n']
}

# Create DataFrame
df = pd.DataFrame(clients)
# Create DataFrame copy to mess around with it
df2 = df
df

  code      nom  age        ville cuisine_a_theme livraison
0  C11   Martin   50     Bordeaux               y         y
1  C22   Durand   40       Pessac               n         y
2  C33  Leboeuf   20     Bordeaux               n         n
3  C44  Carolin   35  La Rochelle               y         n

# Columns

## Add column

In [65]:
# Add column to DataFrame with default value
df2['commentaire'] = ''
df2

  code      nom  age        ville cuisine_a_theme livraison commentaire
0  C11   Martin   50     Bordeaux               y         y
1  C22   Durand   40       Pessac               n         y
2  C33  Leboeuf   20     Bordeaux               n         n
3  C44  Carolin   35  La Rochelle               y         n

## Update column

In [66]:
# Set value for entire column
df2['age'] = 100
df2

  code      nom  age        ville cuisine_a_theme livraison commentaire
0  C11   Martin  100     Bordeaux               y         y
1  C22   Durand  100       Pessac               n         y
2  C33  Leboeuf  100     Bordeaux               n         n
3  C44  Carolin  100  La Rochelle               y         n

In [67]:
# Update column values based on conditions

# Syntax : DataFrame.loc[condition, column_label] = new_value

condition = (df2['ville'] == "Bordeaux")
df2.loc[condition, 'commentaire'] = "A démarcher"
df2

  code      nom  age        ville cuisine_a_theme livraison  commentaire
0  C11   Martin  100     Bordeaux               y         y  A démarcher
1  C22   Durand  100       Pessac               n         y
2  C33  Leboeuf  100     Bordeaux               n         n  A démarcher
3  C44  Carolin  100  La Rochelle               y         n

In [68]:
# Set col values using .loc
df2.loc[:, 'livraison'] = "n"
df2

  code      nom  age        ville cuisine_a_theme livraison  commentaire
0  C11   Martin  100     Bordeaux               y         n  A démarcher
1  C22   Durand  100       Pessac               n         n
2  C33  Leboeuf  100     Bordeaux               n         n  A démarcher
3  C44  Carolin  100  La Rochelle               y         n

## TODO list comprehension / lambda functions

## Delete column

In [69]:
# TODO : check inplace=True

df3 = df2
df3.drop(columns='commentaire')

  code      nom  age        ville cuisine_a_theme livraison
0  C11   Martin  100     Bordeaux               y         n
1  C22   Durand  100       Pessac               n         n
2  C33  Leboeuf  100     Bordeaux               n         n
3  C44  Carolin  100  La Rochelle               y         n

---

# Rows

## Add row

In [70]:
# Can only append a dict if ignore_index=True
# Because we do not provide and Index

newline = {'nom': "newline"}
df2.append(newline, ignore_index=True)

  code      nom    age        ville cuisine_a_theme livraison  commentaire
0  C11   Martin  100.0     Bordeaux               y         n  A démarcher
1  C22   Durand  100.0       Pessac               n         n
2  C33  Leboeuf  100.0     Bordeaux               n         n  A démarcher
3  C44  Carolin  100.0  La Rochelle               y         n
4  NaN  newline    NaN          NaN             NaN       NaN          NaN

## Update row

In [90]:
# Set whole row values using .loc
df2.loc['C22'] = "TODELETE"
df2

,code,nom,age,ville,cuisine_a_theme,livraison,commentaire
0,C11,Martin,100,Bordeaux,y,n,A démarcher
1,C22,Durand,100,Pessac,n,n,
2,C33,Leboeuf,100,Bordeaux,n,n,A démarcher
3,C44,Carolin,100,La Rochelle,y,n,
C22,TODELETE,TODELETE,TODELETE,TODELETE,TODELETE,TODELETE,TODELETE

## Delete row

In [91]:
# Note that the previous code of line "TODELETE" is now the index value
# Wich means we can use it as a label/index value
df2.drop('C22')

  code      nom  age        ville cuisine_a_theme livraison  commentaire
0  C11   Martin  100     Bordeaux               y         n  A démarcher
1  C22   Durand  100       Pessac               n         n
2  C33  Leboeuf  100     Bordeaux               n         n  A démarcher
3  C44  Carolin  100  La Rochelle               y         n

### TODO 
- set na values
- use lambda functions
- Append DataFrame : df.append(df2, ignore_index = True, sort=False)